{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "signature": {"inputs": {"input_3": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"sequential_4": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/global_average_pooling2d_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_1/Conv2D", "op": "Conv2D", "input": ["input_3", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_1/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/pool1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_2/Conv2D"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/pool1/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_2/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_1/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/pool2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_2/Conv2D"], "attr": {"padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/pool2/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_2/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_1/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_2/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_3/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/pool3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_3/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/pool3/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_3/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_1/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_2/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_3/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/pool4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_3/Conv2D"], "attr": {"data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/pool4/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_3/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_1/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_2/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_3/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/pool5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_3/Conv2D"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/pool5/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/global_average_pooling2d_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_3/Relu", "StatefulPartitionedCall/sequential_5/vggface_vgg16/global_average_pooling2d_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5/vggface_vgg16/global_average_pooling2d_1/Mean", "StatefulPartitionedCall/sequential_5/sequential_4/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_5/sequential_4/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/dense_3/BiasAdd", "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/mul_1", "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/leaky_re_lu_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/add_1"], "attr": {"alpha": {"f": 0.05}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_4/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/leaky_re_lu_2/LeakyRelu", "StatefulPartitionedCall/sequential_5/sequential_4/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_5/sequential_4/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/dense_4/BiasAdd", "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/mul_1", "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/leaky_re_lu_3/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.05}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/leaky_re_lu_3/LeakyRelu", "StatefulPartitionedCall/sequential_5/sequential_4/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_5/sequential_4/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_5/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5/sequential_4/dense_5/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of15.bin", "group1-shard2of15.bin", "group1-shard3of15.bin", "group1-shard4of15.bin", "group1-shard5of15.bin", "group1-shard6of15.bin", "group1-shard7of15.bin", "group1-shard8of15.bin", "group1-shard9of15.bin", "group1-shard10of15.bin", "group1-shard11of15.bin", "group1-shard12of15.bin", "group1-shard13of15.bin", "group1-shard14of15.bin", "group1-shard15of15.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_1/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv1_2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_1/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv2_2/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_2/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv3_3/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_1/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv4_3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_1/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/conv5_3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/vggface_vgg16/global_average_pooling2d_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_3/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/mul", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_2/batchnorm/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_4/MatMul/ReadVariableOp", "shape": [512, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_4/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/batch_normalization_3/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_5/MatMul/ReadVariableOp", "shape": [256, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5/sequential_4/dense_5/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}